{"keras_version": "1.2.0", "config": [{"config": {"W_regularizer": null, "W_constraint": null, "nb_filter": 24, "init": "normal", "input_dtype": "float32", "subsample": [1, 1], "activation": "linear", "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 3], "name": "convolution2d_1", "bias": true, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "init": "normal", "subsample": [1, 1], "activation": "linear", "nb_row": 5, "b_constraint": null, "W_constraint": null, "name": "convolution2d_2", "bias": true, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "init": "normal", "subsample": [1, 1], "activation": "linear", "nb_row": 5, "b_constraint": null, "W_constraint": null, "name": "convolution2d_3", "bias": true, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "init": "normal", "subsample": [1, 1], "activation": "linear", "nb_row": 2, "b_constraint": null, "W_constraint": null, "name": "convolution2d_4", "bias": true, "nb_col": 2, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "init": "normal", "subsample": [1, 1], "activation": "linear", "nb_row": 2, "b_constraint": null, "W_constraint": null, "name": "convolution2d_5", "bias": true, "nb_col": 2, "b_regularizer": null, "border_mode": "valid", "trainable": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "name": "dense_1", "bias": true, "b_regularizer": null, "output_dim": 1164, "trainable": true, "activity_regularizer": null, "input_dim": 2432}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "name": "dense_2", "bias": true, "b_regularizer": null, "output_dim": 100, "trainable": true, "activity_regularizer": null, "input_dim": 1164}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "name": "dense_3", "bias": true, "b_regularizer": null, "output_dim": 50, "trainable": true, "activity_regularizer": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "name": "dense_4", "bias": true, "b_regularizer": null, "output_dim": 10, "trainable": true, "activity_regularizer": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "name": "dense_5", "bias": true, "b_regularizer": null, "output_dim": 1, "trainable": true, "activity_regularizer": null, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}